Revit 2027 API
DistributionSysType.ElectricalPhaseConfiguration Property
 Get or set electrical phase configuration (Y, delta or undefined) of distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalPhaseConfiguration ElectricalPhaseConfiguration { get; set; }
Public Property ElectricalPhaseConfiguration As ElectricalPhaseConfiguration
	Get
	Set
public:
property ElectricalPhaseConfiguration ElectricalPhaseConfiguration {
	ElectricalPhaseConfiguration get ();
	void set (ElectricalPhaseConfiguration value);
}
member ElectricalPhaseConfiguration : ElectricalPhaseConfiguration with get, set
Property Value
ElectricalPhaseConfiguration
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace